Tekla.Structures.Model.LoftedPlate.FaceType
Defines what type of solid faces will be used to create lofted plate solid.

Tekla.Structures.Model.LoftedPlate.IsSimpleCurve(Tekla.Structures.Geometry3d.ICurve)
Checks if the given curve is a single curve (and not a polycurve).
curve: Input curve
Returns: True if the curve is simple, false otherwise